function solution(ingredient) {
    let answer = 0;
    let stack = [];
    for (let i = 0; i < ingredient.length; i++){
        stack.push(ingredient[i]);
        if (stack.slice(-4).join('') === '1231') {
            stack.splice(-4);
            answer++;
        }
    }
    return answer;
}
console.log(solution([1, 1, 2, 1, 2, 3, 1, 3, 1, 2, 3, 1]));

// [1, 1, 2, 1, 2, 3, 1, 3, 1, 2, 3, 1] 3 <- 3~12 오류나시는분들은 이거체크 이거 3나와야하는데 2 나오셨으면 인덱스 잘못 건드리신거
// [1, 1, 1, 2, 3, 1, 2, 3, 1, 2, 3, 1] 3
// [1, 2, 3, 1, 2, 3, 1, 1, 1, 1, 2, 3, 1, 2, 3, 1, 1, 1, 1, 1, 1, 2, 3, 3, 1, 2, 3, 1, 3, 3, 3, 2, 1, 2, 3, 1] 5
// [1, 2, 3, 1, 2, 3, 1, 1, 1, 1, 2, 3, 1, 2, 3, 1, 1, 1, 1, 1, 1, 2, 3, 3, 1] 3
// [1, 2, 3, 1, 2, 3, 1, 1, 1, 1, 2, 3, 1, 2, 3, 1] 3
// [1, 2, 2, 3, 1] 0